app/controllers/messages_controller.rb

  def show
    begin
      @message = Message.find_by_short_url(params[:id])
      @message.destroy
---
DELETE FROM "messages" WHERE "id" = 16

  def create
    @message = Message.new(params[:message])
    logger.debug "New message: #{@message.attributes.inspect}"
    success = @message && @message.save
    if success && @message.errors.empty?
---
INSERT INTO "messages" ("updated_at", "short_url", "message_salt", "user_id", "created_at", "message_hash") VALUES('2010-08-24 11:11:19', NULL, '5aZiuyKi', NULL, '2010-08-24 11:11:19', 'î∏d	p¶0o‘è‚Åï+ÈÃ}6gmﬂzÕüs‚ˆÄ√A')
SELECT * FROM "messages"

  def confirm
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 16)